zamboni-vita.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-01-04 Sat 21:13 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>IT Enterprise Security Architect · Computer Scientist · Team and Project Leader</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Diego Zamboni" />
</head>
<body>
<div id="content">
<h1 class="title">IT Enterprise Security Architect · Computer Scientist · Team and Project Leader</h1>
<p>

</p>
<div id="outline-container-org6114d37" class="outline-2">
<h2 id="org6114d37"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
I am a senior computer security expert, IT architect, computer scientist, team and project leader with 29 years of professional experience. I specialize in the areas of Computer Security, Cloud Computing, Self-healing Systems and Configuration management. I possess a strong combination of leadership and technical skills that enable me to lead teams in analyzing complex problems, designing and implementing elegant and pragmatic solutions. I have strong communication abilities, with ample experience in writing, teaching and public speaking. I can interact and work fluently at the strategic, tactical and technical levels. I have a Ph.D. in Computer Science and have experience in both academic and business environments.
</p>
</div>
</div>

<div id="outline-container-org891a9f0" class="outline-2">
<h2 id="org891a9f0"><span class="section-number-2">2</span> Skill and Experience Overview</h2>
<div class="outline-text-2" id="text-2">
<dl class="org-dl">
<dt>Computer Security</dt><dd>Enterprise Security Architecture, Intrusion detection and prevention (Ph.D. in Computer Science in this area), operating systems security, network security, software security, secure software development, virtualization and cloud computing security, malware detection and containment.</dd>
<dt>Leadership</dt><dd>Technical team and project leadership, <a href="https://www.scaledagile.com/">Scaled Agile Framework (SAFe)</a> methodology and processes, SAFe Product Owner certification, SAFe Architect training.</dd>
<dt>Systems and Development</dt><dd>Unix/Linux systems engineering and administration, systems health management and monitoring, cloud computing environments and platforms (OpenStack, Amazon EC2, Cloud Foundry) and software development experience (C, Python, Ruby, Perl, Java, etc.).</dd>
<dt>Configuration management</dt><dd>CFEngine (Author of <a href="https://cf-learn.info/"><i>Learning CFEngine</i></a>), Ansible, Puppet.</dd>
<dt>Communications</dt><dd>Excellent written and spoken communication skills, with more than 30 years of  written and oral communication and teaching experience in different contexts and topics.</dd>
<dt>Languages</dt><dd>Spanish (native), English (100%), German (B1/B2 level).</dd>
<dt>Other skills</dt><dd>Customer-facing experience, project and product management experience.</dd>
</dl>
</div>
</div>
