zamboni-vita.org
** Swisscom
:PROPERTIES:
:CV_ENV:   cvemployer
:LOCATION: Switzerland
:FROM: 2015
:END:

*** Enterprise Security Architect
:PROPERTIES:
:CV_ENV:   cvsubentry
:FROM: <2019-04-01>
:END:

- As Security Architect for the IT Clouds Large Solution, I participate in the design and definition of security-relevant capabilities, compliance and business goals of cloud platforms built by Swisscom.
- As Enterprise Architect, I participate in the overall design, discussion and proposals regarding the future of the products and solutions offered by Swisscom.

*** Squad Lead & Product Owner for /Health & State Management/ in the IT Clouds Large Solution
:PROPERTIES:
:CV_ENV:   cvsubentry
:FROM: <2018-04-01>
:TO: <2019-04-01>
:END:

- The HSM team has an expanded scope to design, implement and manage Health Management and Monitoring components for all the IT Clouds platforms, including Enterprise Service Cloud, Application Cloud, Enterprise Cloud 1.x, Enterprise Cloud for SAP applications (EC4SAP), Marketplace Services, and Cloud Connectivity Management.
- Main technologies involved: VMware vSphere (ESX, vCenter, NSX), VMware vRealize Operations Manager and Log Insight, Ansible (configuration management), OpsGenie (alert management).

*** Squad Lead & Product Owner for /Health & State Management/ in the Enterprise Service Cloud project
:PROPERTIES:
:CV_ENV:   cvsubentry
:EMPLOYER: Swisscom
:LOCATION: Switzerland
:FROM: <2017-01-01>
:TO: <2018-03-01>
:END:

- Worked with Product Management to define the technical features necessary for Health Management and Monitoring in the Enterprise Service Cloud project, and lead the team which implements, deploys and operates these components.

*** Head of /Health and State Management/
:PROPERTIES:
:CV_ENV:   cvsubentry
:EMPLOYER: Swisscom
:LOCATION: Switzerland
:FROM: <2016-03-01>
:TO: <2017-01-01>
:END:

- Led a team working on multiple projects related to Health Management and Monitoring of the Swisscom cloud offerings, including Application Cloud (CloudFoundry-based PaaS offering), Enterprise Cloud 1.x and Enterprise Service Cloud (IaaS offerings).

*** LEMM Squad Lead in the Enterprise Cloud project
:PROPERTIES:
:CV_ENV:   cvsubentry
:EMPLOYER: Swisscom
:LOCATION: Switzerland
:FROM: <2016-06-01>
:TO: <2016-12-31>
:END:

- Led the architecture and delivery of the Logging, Event Management and Monitoring framework (LEMM) of the Swisscom Enterprise Cloud, which handles all the processing, analysis and monitoring of the logging messages, health events, and other relevant infrastructure events.

*** Cloud Architect and Orchard Project Lead
:PROPERTIES:
:CV_ENV:   cvsubentry
:EMPLOYER: Swisscom
:LOCATION: Switzerland
:FROM: <2015-08-01>
:TO: <2016-03-01>
:END:

- Continued leading the /Orchard/ project through its implementation, release and further improvements and development.

** Swisscom Cloud Lab
:PROPERTIES:
:CV_ENV:   cvemployer
:LOCATION: U.S.A. (remote)
:FROM: 2014
:TO: 2015
:END:

*** Senior Platform Architect
:PROPERTIES:
:CV_ENV:   cvsubentry
:FROM: <2014-08-01>
:TO: <2015-07-31>
:END:

- I designed the architecture for the /Orchard/ health-management and self-healing components of Swisscom's /Application Cloud/ Platform-as-a-Service Offering. This system performs self-monitoring and self-healing of the infrastructure and platform components. In addition to designing the architecture, I worked on its implementation together with a team of three people managed by me.
- Main technologies involved: OpenStack (cloud computing infrastructure), Plumgrid (SDN), Cloud Foundry (application platform), Consul (health management and service discovery), RabbitMQ (message bus), Riemann (event stream analysis).

** CFEngine AS
:PROPERTIES:
:CV_ENV:   cvemployer
:LOCATION: Norway/U.S.A. (remote)
:FROM:     2011
:TO:       2014
:END:

*** Product Manager
:PROPERTIES:
:CV_ENV:   cvsubentry
:FROM:     <2013-08-01>
:TO: <2014-06-30>
:END:

- Coordinated the [[http://cfengine.com/cfengine-design-center/][CFEngine Design Center]] project.
- Participated in the development of the CFEngine language roadmap.
- Coordinated the work on CFEngine third-party integration  (e.g. AWS EC2, VMware, Docker and OpenStack).
- Developed code for both the Design Center and some of the integrations.

*** Senior Security Advisor
:PROPERTIES:
:CV_ENV:   cvsubentry
:FROM:     <2011-10-01>
:TO: <2014-06-30>
:END:

- Overall advocate and fanatic for CFEngine, with a special focus on security.
- Gave talks, wrote articles and blog posts, taught classes, and in general spread the word about CFEngine.
- Worked on developing and implementing the strategy for CFEngine in security.

** HP Enterprise Services
:PROPERTIES:
:CV_ENV:   cvemployer
:LOCATION: Mexico
:FROM:     2009
:TO:       2011
:END:

*** Account Security Officer
:PROPERTIES:
:CV_ENV:   cvsubentry
:FROM: <2010-10-01>
:TO: <2011-10-01>
:END:

-  I was the first point of contact for all security-related issues for five HP enterprise customers in Mexico, some of them with international presence.
-  Initiated, advised and managed security-related projects.
-  Handled communication and coordination between technical teams involved in security initiatives.
-  Involved in all security-related decisions at the sales, design, implementation, delivery and ongoing maintenance stages of IT Outsourcing projects.

*** IT Outsourcing Service Delivery Consultant
:PROPERTIES:
:CV_ENV:   cvsubentry
:FROM: <2009-11-01>
:TO: <2010-10-01>
:END:

- I helped customer teams by solving complex problems in customer environments.
- Performed analysis, design and implementation of solutions in multiple areas of expertise, including system automation, configuration management, system administration, system design, virtualization, performance and security.

** IBM Zurich Research Lab
:PROPERTIES:
:CV_ENV:   cvemployer
:LOCATION: Switzerland
:FROM:     2001
:TO:       2009
:END:

*** Research Staff Member
:PROPERTIES:
:CV_ENV:   cvsubentry
:FROM:     <2001-10-01>
:TO:       <2009-10-01>
:END:

- I worked in intrusion detection, malware detection and containment, and virtualization security research projects. See /Research activities/ for details of my research.

** Sun Microsystems
:PROPERTIES:
:CV_ENV:   cvemployer
:LOCATION: U.S.A.
:FROM:     1997
:TO:       1997
:END:

