zamboni-vita.html

<div id="outline-container-orgc29dfcc" class="outline-2">
<h2 id="orgc29dfcc"><span class="section-number-2">3</span> Experience</h2>
<div class="outline-text-2" id="text-3">
</div>

<div id="outline-container-org266e6c5" class="outline-3">
<h3 id="org266e6c5">Swisscom</h3>
<div class="outline-text-3" id="text-org266e6c5">
<pre class="example">
LOCATION: Switzerland
FROM: 2015
</pre>
</div>

<div id="outline-container-org65f5672" class="outline-4">
<h4 id="org65f5672">Enterprise Security Architect</h4>
<div class="outline-text-4" id="text-org65f5672">
<pre class="example">
FROM: <2019-04-01>
</pre>

<ul class="org-ul">
<li>As Security Architect for the IT Clouds Large Solution, I participate in the design and definition of security-relevant capabilities, compliance and business goals of cloud platforms built by Swisscom.</li>
<li>As Enterprise Architect, I participate in the overall design, discussion and proposals regarding the future of the products and solutions offered by Swisscom.</li>
</ul>
</div>
</div>

<div id="outline-container-org63be581" class="outline-4">
<h4 id="org63be581">Squad Lead &amp; Product Owner for Health &amp; State Management in the IT Clouds Large Solution</h4>
<div class="outline-text-4" id="text-org63be581">
<pre class="example">
FROM: <2018-04-01>
TO: <2019-04-01>
</pre>

<ul class="org-ul">
<li>The HSM team has an expanded scope to design, implement and manage Health Management and Monitoring components for all the IT Clouds platforms, including Enterprise Service Cloud, Application Cloud, Enterprise Cloud 1.x, Enterprise Cloud for SAP applications (EC4SAP), Marketplace Services, and Cloud Connectivity Management.</li>
<li>Main technologies involved: VMware vSphere (ESX, vCenter, NSX), VMware vRealize Operations Manager and Log Insight, Ansible (configuration management), OpsGenie (alert management).</li>
</ul>
</div>
</div>

<div id="outline-container-org9ec585c" class="outline-4">
<h4 id="org9ec585c">Squad Lead &amp; Product Owner for Health &amp; State Management in the Enterprise Service Cloud project</h4>
<div class="outline-text-4" id="text-org9ec585c">
<pre class="example">
EMPLOYER: Swisscom
LOCATION: Switzerland
FROM: <2017-01-01>
TO: <2018-03-01>
</pre>

<ul class="org-ul">
<li>Worked with Product Management to define the technical features necessary for Health Management and Monitoring in the Enterprise Service Cloud project, and lead the team which implements, deploys and operates these components.</li>
</ul>
</div>
</div>

<div id="outline-container-org1fcb2d8" class="outline-4">
<h4 id="org1fcb2d8">Head of Health and State Management</h4>
<div class="outline-text-4" id="text-org1fcb2d8">
<pre class="example">
EMPLOYER: Swisscom
LOCATION: Switzerland
FROM: <2016-03-01>
TO: <2017-01-01>
</pre>

<ul class="org-ul">
<li>Led a team working on multiple projects related to Health Management and Monitoring of the Swisscom cloud offerings, including Application Cloud (CloudFoundry-based PaaS offering), Enterprise Cloud 1.x and Enterprise Service Cloud (IaaS offerings).</li>
</ul>
</div>
</div>

<div id="outline-container-org7d3e838" class="outline-4">
<h4 id="org7d3e838">LEMM Squad Lead in the Enterprise Cloud project</h4>
<div class="outline-text-4" id="text-org7d3e838">
<pre class="example">
EMPLOYER: Swisscom
LOCATION: Switzerland
FROM: <2016-06-01>
TO: <2016-12-31>
</pre>

<ul class="org-ul">
<li>Led the architecture and delivery of the Logging, Event Management and Monitoring framework (LEMM) of the Swisscom Enterprise Cloud, which handles all the processing, analysis and monitoring of the logging messages, health events, and other relevant infrastructure events.</li>
</ul>
</div>
</div>

<div id="outline-container-org4d993ca" class="outline-4">
<h4 id="org4d993ca">Cloud Architect and Orchard Project Lead</h4>
<div class="outline-text-4" id="text-org4d993ca">
<pre class="example">
EMPLOYER: Swisscom
LOCATION: Switzerland
FROM: <2015-08-01>
TO: <2016-03-01>
</pre>

<ul class="org-ul">
<li>Continued leading the <i>Orchard</i> project through its implementation, release and further improvements and development.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orge3cc503" class="outline-3">
<h3 id="orge3cc503">Swisscom Cloud Lab</h3>
<div class="outline-text-3" id="text-orge3cc503">
<pre class="example">
LOCATION: U.S.A. (remote)
FROM: 2014
TO: 2015
</pre>
</div>

<div id="outline-container-orgc4f6b24" class="outline-4">
<h4 id="orgc4f6b24">Senior Platform Architect</h4>
<div class="outline-text-4" id="text-orgc4f6b24">
<pre class="example">
FROM: <2014-08-01>
TO: <2015-07-31>
</pre>

<ul class="org-ul">
<li>I designed the architecture for the <i>Orchard</i> health-management and self-healing components of Swisscom's <i>Application Cloud</i> Platform-as-a-Service Offering. This system performs self-monitoring and self-healing of the infrastructure and platform components. In addition to designing the architecture, I worked on its implementation together with a team of three people managed by me.</li>
<li>Main technologies involved: OpenStack (cloud computing infrastructure), Plumgrid (SDN), Cloud Foundry (application platform), Consul (health management and service discovery), RabbitMQ (message bus), Riemann (event stream analysis).</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org8107e49" class="outline-3">
<h3 id="org8107e49">CFEngine AS</h3>
<div class="outline-text-3" id="text-org8107e49">
<pre class="example">
LOCATION: Norway/U.S.A. (remote)
FROM: 2011
TO: 2014
</pre>
</div>

<div id="outline-container-orgef5c30b" class="outline-4">
<h4 id="orgef5c30b">Product Manager</h4>
<div class="outline-text-4" id="text-orgef5c30b">
<pre class="example">
FROM: <2013-08-01>
TO: <2014-06-30>
</pre>

<ul class="org-ul">
<li>Coordinated the <a href="http://cfengine.com/cfengine-design-center/">CFEngine Design Center</a> project.</li>
<li>Participated in the development of the CFEngine language roadmap.</li>
<li>Coordinated the work on CFEngine third-party integration  (e.g. AWS EC2, VMware, Docker and OpenStack).</li>
<li>Developed code for both the Design Center and some of the integrations.</li>
</ul>
</div>
</div>

<div id="outline-container-org735f580" class="outline-4">
<h4 id="org735f580">Senior Security Advisor</h4>
<div class="outline-text-4" id="text-org735f580">
<pre class="example">
FROM: <2011-10-01>
TO: <2014-06-30>
</pre>

<ul class="org-ul">
<li>Overall advocate and fanatic for CFEngine, with a special focus on security.</li>
<li>Gave talks, wrote articles and blog posts, taught classes, and in general spread the word about CFEngine.</li>
<li>Worked on developing and implementing the strategy for CFEngine in security.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orge53e9d7" class="outline-3">
<h3 id="orge53e9d7">HP Enterprise Services</h3>
<div class="outline-text-3" id="text-orge53e9d7">
<pre class="example">
LOCATION: Mexico
FROM: 2009
TO: 2011
</pre>
</div>

<div id="outline-container-org5a3e971" class="outline-4">
<h4 id="org5a3e971">Account Security Officer</h4>
<div class="outline-text-4" id="text-org5a3e971">
<pre class="example">
FROM: <2010-10-01>
TO: <2011-10-01>
</pre>

<ul class="org-ul">
<li>I was the first point of contact for all security-related issues for five HP enterprise customers in Mexico, some of them with international presence.</li>
<li>Initiated, advised and managed security-related projects.</li>
<li>Handled communication and coordination between technical teams involved in security initiatives.</li>
<li>Involved in all security-related decisions at the sales, design, implementation, delivery and ongoing maintenance stages of IT Outsourcing projects.</li>
</ul>
</div>
</div>

<div id="outline-container-org1acc8f7" class="outline-4">
<h4 id="org1acc8f7">IT Outsourcing Service Delivery Consultant</h4>
<div class="outline-text-4" id="text-org1acc8f7">
<pre class="example">
FROM: <2009-11-01>
TO: <2010-10-01>
</pre>

<ul class="org-ul">
<li>I helped customer teams by solving complex problems in customer environments.</li>
<li>Performed analysis, design and implementation of solutions in multiple areas of expertise, including system automation, configuration management, system administration, system design, virtualization, performance and security.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org608cb7b" class="outline-3">
<h3 id="org608cb7b">IBM Zurich Research Lab</h3>
<div class="outline-text-3" id="text-org608cb7b">
<pre class="example">
LOCATION: Switzerland
FROM: 2001
TO: 2009
</pre>
</div>

<div id="outline-container-org51d9668" class="outline-4">
<h4 id="org51d9668">Research Staff Member</h4>
<div class="outline-text-4" id="text-org51d9668">
<pre class="example">
FROM: <2001-10-01>
TO: <2009-10-01>
</pre>

<ul class="org-ul">
<li>I worked in intrusion detection, malware detection and containment, and virtualization security research projects. See <i>Research activities</i> for details of my research.</li>
</ul>
</div>
</div>
</div>
