zamboni-vita.org
*** Developer (Intern)
:PROPERTIES:
:CV_ENV:   cvsubentry
:FROM:     <1997-05-01>
:TO:       <1997-08-01>
:END:

- Participated in the development of the /Bruce/ host vulnerability scanner, later released as the [[http://www.usenix.org/publications/login/1999-11/features/senss.html][Sun Enterprise Network Security Service]] (SENSS).
- Designed and implemented the first version of the network-based components of /Bruce/, which allowed it to operate on several hosts in a network, controlled from a central location.

** National Autonomous University of Mexico (UNAM)
:PROPERTIES:
:CV_ENV:   cvemployer
:LOCATION: Mexico
:FROM:     1991
:TO:       1996
:END:

*** Head of [[http://www.seguridad.unam.mx/][Computer Security Area]]
:PROPERTIES:
:CV_ENV:   cvsubentry
:FROM:     <1995-08-01>
:TO:       <1996-08-01>
:END:

- Founded UNAM's [[http://www.seguridad.unam.mx/][Computer Security Area]], the University's first team dedicated to computer security, which has since evolved into a much larger organization.
- Supervised up to nine people working on different projects related to computer security.
- Supervised and participated in the direct monitoring of the security of a Cray supercomputer and 22 Unix workstations.
- Provided security services to the whole University, including incident response, security information, auditing and teaching.
- Established the celebration of the /International Computer Security Day/ (sponsored by the Association for Computing Machinery) at UNAM.  Acted as the main organizer of the event for two years (1994 and 1995). This event has grown and divided into the /Computer Security Day/ (a one-day event) and the /Seguridad en Cómputo/ (Computer Security) conference (a multi-day event).
- Designed and headed development of an audit-analysis tool for Unix systems (SAINT).

*** System Administrator
:PROPERTIES:
:CV_ENV:   cvsubentry
:FROM:     <1991-11-01>
:TO:       <1995-08-01>
:END:

- Part of the system administration team at the University's Supercomputing Center, managing UNAM's [[http://www.historiadelcomputo.unam.mx/files/fotos/Cray/cray.html][Cray Y-MP Supercomputer]] (the first supercomputer in Latin America) and related systems.
- Managed the Network Queuing Subsystem (NQS).
- Collaborated in other aspects of the supercomputer administration, including user administration, operating system installation, resource management, and policy making and implementation.
- Directly managed three Unix workstations, provided support for 19 more.
- Monitored the security of the Cray supercomputer and related workstations.

* Education
:PROPERTIES:
:CV_ENV:   cventries
:END:

** Ph.D. in Computer Science
:PROPERTIES:
:CV_ENV:   cvschool
:LOCATION: West Lafayette, IN, U.S.A.
:SCHOOL: Purdue University
:FROM: <1996-08-01>
:TO: <2001-08-01>
:END:

- Thesis title: [[https://zzamboni.org/files/theses/zamboni-phd-thesis.pdf][/Using Internal Sensors for Computer Intrusion Detection/]].
- Advisor: [[http://spaf.cerias.purdue.edu/][Eugene H. Spafford]].

** M.S. in Computer Science
:PROPERTIES:
:CV_ENV:   cvschool
:LOCATION: West Lafayette, IN, U.S.A.
:SCHOOL: Purdue University
:FROM: <1996-08-01>
:TO: <1998-05-01>
:END:

- Advisor: [[http://spaf.cerias.purdue.edu/][Eugene H. Spafford]].

** Bachelor's degree in Computer Engineering
:PROPERTIES:
:CV_ENV:   cvschool
:LOCATION: Mexico City, Mexico
:SCHOOL: National Autonomous University of Mexico (UNAM)
:FROM: <1989-08-01>
:TO: <1995-07-01>
:END:

- Thesis title: [[https://zzamboni.org/files/theses/zamboni-bachelors-thesis.pdf][UNAM/Cray Project for Security in the Unix Operating System]] (in Spanish, original title: /Proyecto UNAM/Cray de Seguridad en el Sistema Operativo Unix/).

* Certifications
:PROPERTIES:
:CV_ENV:   cventries
:END:

** [[https://www.youracclaim.com/badges/98814af3-575b-4350-9667-70eddfea1da4/public_url][Certified Information Systems Security Professional (CISSP)]]
:PROPERTIES:
:CV_ENV:   cvschool
:ORGANIZATION: (ISC)², the International Information System Security Certification Consortium
:LOCATION: April 2019
:RIGHT_IMG: ./images/certified-information-systems-security-professional-cissp-large.png
:END:

#+begin_cvitems
The vendor-neutral CISSP credential confirms technical knowledge and experience to design, engineer, implement, and manage the overall security posture of an organization. Required by the world’s most security-conscious organizations, CISSP is the gold-standard information security certification that assures information security leaders possess the breadth and depth of knowledge to establish holistic security programs that protect against threats in an increasingly complex cyber world.
#+end_cvitems

** [[https://www.youracclaim.com/badges/e6bf0ca2-f1c4-4af6-bf63-09f4b8cdbd02/public_url][SAFe\reg 4 Certified Product Owner/Product Manager]]
:PROPERTIES:
:CV_ENV:   cvschool
:ORGANIZATION: Scaled Agile Inc.
:LOCATION: July 2017
:RIGHT_IMG: ./images/certified-safe-4-product-owner-product-manager-large.png
:END:

#+begin_cvitems
A SAFe\reg 4 Certified Product Owner/Product Manager is a SAFe professional who works with customers and development organizations to identify and write requirements. Key areas of competency include identifying customer needs, writing epics, capabilities, features, stories, and prioritizing work in order to effectively deliver value to the enterprise.
#+end_cvitems

* Research
:PROPERTIES:
:CV_ENV:   cventries
:END:

#+begin_cvparagraph
(see ``Publications'' for publication reference details)
#+end_cvparagraph

** Research projects at IBM (selected)
:PROPERTIES:
:CV_ENV:   cvemployer
:END:

*** [[http://www-03.ibm.com/press/us/en/pressrelease/23833.wss][Project Phantom]]
:PROPERTIES:
:CV_ENV:   cvsubentry
:FROM:     2008
:TO:       2009
:END:

- Security for VMware virtual environments using virtual machine introspection (based on the [[https://vmguru.com/2011/03/vmsafe-api/][VMware VMsafe API]]) to provide detection and prevention capabilities with increased security and reliability.
- Publications: {{{cvcite(Christodorescu:2009:CSV:1655008.1655022)}}}.

*** Code instrumentation for intrusion detection
:PROPERTIES:
:CV_ENV:   cvsubentry
:FROM: 2007
:TO: 2007
:END:

- Exploration of code instrumentation and low-level monitoring mechanisms for  efficient and accurate intrusion detection and prevention.

