zamboni-vita.html

<div id="outline-container-org0cf01b7" class="outline-3">
<h3 id="org0cf01b7">Sun Microsystems</h3>
<div class="outline-text-3" id="text-org0cf01b7">
<pre class="example">
LOCATION: U.S.A.
FROM: 1997
TO: 1997
</pre>
</div>

<div id="outline-container-org50338a0" class="outline-4">
<h4 id="org50338a0">Developer (Intern)</h4>
<div class="outline-text-4" id="text-org50338a0">
<pre class="example">
FROM: <1997-05-01>
TO: <1997-08-01>
</pre>

<ul class="org-ul">
<li>Participated in the development of the <i>Bruce</i> host vulnerability scanner, later released as the <a href="http://www.usenix.org/publications/login/1999-11/features/senss.html">Sun Enterprise Network Security Service</a> (SENSS).</li>
<li>Designed and implemented the first version of the network-based components of <i>Bruce</i>, which allowed it to operate on several hosts in a network, controlled from a central location.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgc0e056c" class="outline-3">
<h3 id="orgc0e056c">National Autonomous University of Mexico (UNAM)</h3>
<div class="outline-text-3" id="text-orgc0e056c">
<pre class="example">
LOCATION: Mexico
FROM: 1991
TO: 1996
</pre>
</div>

<div id="outline-container-org0f6b51a" class="outline-4">
<h4 id="org0f6b51a">Head of <a href="http://www.seguridad.unam.mx/">Computer Security Area</a></h4>
<div class="outline-text-4" id="text-org0f6b51a">
<pre class="example">
FROM: <1995-08-01>
TO: <1996-08-01>
</pre>

<ul class="org-ul">
<li>Founded UNAM's <a href="http://www.seguridad.unam.mx/">Computer Security Area</a>, the University's first team dedicated to computer security, which has since evolved into a much larger organization.</li>
<li>Supervised up to nine people working on different projects related to computer security.</li>
<li>Supervised and participated in the direct monitoring of the security of a Cray supercomputer and 22 Unix workstations.</li>
<li>Provided security services to the whole University, including incident response, security information, auditing and teaching.</li>
<li>Established the celebration of the <i>International Computer Security Day</i> (sponsored by the Association for Computing Machinery) at UNAM.  Acted as the main organizer of the event for two years (1994 and 1995). This event has grown and divided into the <i>Computer Security Day</i> (a one-day event) and the <i>Seguridad en Cómputo</i> (Computer Security) conference (a multi-day event).</li>
<li>Designed and headed development of an audit-analysis tool for Unix systems (SAINT).</li>
</ul>
</div>
</div>

<div id="outline-container-org9973c3a" class="outline-4">
<h4 id="org9973c3a">System Administrator</h4>
<div class="outline-text-4" id="text-org9973c3a">
<pre class="example">
FROM: <1991-11-01>
TO: <1995-08-01>
</pre>

<ul class="org-ul">
<li>Part of the system administration team at the University's Supercomputing Center, managing UNAM's <a href="http://www.historiadelcomputo.unam.mx/files/fotos/Cray/cray.html">Cray Y-MP Supercomputer</a> (the first supercomputer in Latin America) and related systems.</li>
<li>Managed the Network Queuing Subsystem (NQS).</li>
<li>Collaborated in other aspects of the supercomputer administration, including user administration, operating system installation, resource management, and policy making and implementation.</li>
<li>Directly managed three Unix workstations, provided support for 19 more.</li>
<li>Monitored the security of the Cray supercomputer and related workstations.</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc5e6f0f" class="outline-2">
<h2 id="orgc5e6f0f"><span class="section-number-2">4</span> Education</h2>
<div class="outline-text-2" id="text-4">
</div>

<div id="outline-container-orga4477bc" class="outline-3">
<h3 id="orga4477bc">Ph.D. in Computer Science</h3>
<div class="outline-text-3" id="text-orga4477bc">
<pre class="example">
LOCATION: West Lafayette, IN, U.S.A.
SCHOOL: Purdue University
FROM: <1996-08-01>
TO: <2001-08-01>
</pre>

<ul class="org-ul">
<li>Thesis title: <a href="https://zzamboni.org/files/theses/zamboni-phd-thesis.pdf"><i>Using Internal Sensors for Computer Intrusion Detection</i></a>.</li>
<li>Advisor: <a href="http://spaf.cerias.purdue.edu/">Eugene H. Spafford</a>.</li>
</ul>
</div>
</div>

<div id="outline-container-org1d5595a" class="outline-3">
<h3 id="org1d5595a">M.S. in Computer Science</h3>
<div class="outline-text-3" id="text-org1d5595a">
<pre class="example">
LOCATION: West Lafayette, IN, U.S.A.
SCHOOL: Purdue University
FROM: <1996-08-01>
TO: <1998-05-01>
</pre>

<ul class="org-ul">
<li>Advisor: <a href="http://spaf.cerias.purdue.edu/">Eugene H. Spafford</a>.</li>
</ul>
</div>
</div>

<div id="outline-container-org96064f0" class="outline-3">
<h3 id="org96064f0">Bachelor's degree in Computer Engineering</h3>
<div class="outline-text-3" id="text-org96064f0">
<pre class="example">
LOCATION: Mexico City, Mexico
SCHOOL: National Autonomous University of Mexico (UNAM)
FROM: <1989-08-01>
TO: <1995-07-01>
</pre>

<ul class="org-ul">
<li>Thesis title: <a href="https://zzamboni.org/files/theses/zamboni-bachelors-thesis.pdf">UNAM/Cray Project for Security in the Unix Operating System</a> (in Spanish, original title: <i>Proyecto UNAM/Cray de Seguridad en el Sistema Operativo Unix</i>).</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgdb9beb1" class="outline-2">
<h2 id="orgdb9beb1"><span class="section-number-2">5</span> Certifications</h2>
<div class="outline-text-2" id="text-5">
</div>

<div id="outline-container-orgcec07a8" class="outline-3">
<h3 id="orgcec07a8"><a href="https://www.youracclaim.com/badges/98814af3-575b-4350-9667-70eddfea1da4/public_url">Certified Information Systems Security Professional (CISSP)</a></h3>
<div class="outline-text-3" id="text-orgcec07a8">
<pre class="example">
ORGANIZATION: (ISC)², the International Information System Security Certification Consortium
LOCATION: April 2019
</pre>

<div class="cvitems">
<p>
The vendor-neutral CISSP credential confirms technical knowledge and experience to design, engineer, implement, and manage the overall security posture of an organization. Required by the world’s most security-conscious organizations, CISSP is the gold-standard information security certification that assures information security leaders possess the breadth and depth of knowledge to establish holistic security programs that protect against threats in an increasingly complex cyber world.
</p>

</div>
</div>
</div>

<div id="outline-container-org20ff07c" class="outline-3">
<h3 id="org20ff07c"><a href="https://www.youracclaim.com/badges/e6bf0ca2-f1c4-4af6-bf63-09f4b8cdbd02/public_url">SAFe&reg; 4 Certified Product Owner/Product Manager</a></h3>
<div class="outline-text-3" id="text-org20ff07c">
<pre class="example">
ORGANIZATION: Scaled Agile Inc.
LOCATION: July 2017
</pre>

<div class="cvitems">
<p>
A SAFe&reg; 4 Certified Product Owner/Product Manager is a SAFe professional who works with customers and development organizations to identify and write requirements. Key areas of competency include identifying customer needs, writing epics, capabilities, features, stories, and prioritizing work in order to effectively deliver value to the enterprise.
</p>

</div>
</div>
</div>
</div>

<div id="outline-container-org4456ef6" class="outline-2">
<h2 id="org4456ef6"><span class="section-number-2">6</span> Research</h2>
<div class="outline-text-2" id="text-6">
<div class="cvparagraph">
<p>
(see ``Publications'' for publication reference details)
</p>

</div>
</div>

<div id="outline-container-org6d3da66" class="outline-3">
<h3 id="org6d3da66">Research projects at IBM (selected)</h3>
<div class="outline-text-3" id="text-org6d3da66">
</div>

<div id="outline-container-org3e8af74" class="outline-4">
<h4 id="org3e8af74"><a href="http://www-03.ibm.com/press/us/en/pressrelease/23833.wss">Project Phantom</a></h4>
<div class="outline-text-4" id="text-org3e8af74">
<pre class="example">
FROM: 2008
TO: 2009
</pre>

<ul class="org-ul">
<li>Security for VMware virtual environments using virtual machine introspection (based on the <a href="https://vmguru.com/2011/03/vmsafe-api/">VMware VMsafe API</a>) to provide detection and prevention capabilities with increased security and reliability.</li>
<li>Publications: \cite{Christodorescu:2009:CSV:1655008.1655022}.</li>
</ul>
</div>
</div>

<div id="outline-container-org4824bb5" class="outline-4">
<h4 id="org4824bb5">Code instrumentation for intrusion detection</h4>
<div class="outline-text-4" id="text-org4824bb5">
<pre class="example">
FROM: 2007
TO: 2007
</pre>

<ul class="org-ul">
<li>Exploration of code instrumentation and low-level monitoring mechanisms for  efficient and accurate intrusion detection and prevention.</li>
</ul>
</div>
</div>
