zamboni-vita.org
*** [[http://domino.research.ibm.com/library/cyberdig.nsf/1e4115aea78b6e7c85256b360066f0d4/d7c39a9a2e73d870852570060051dfed?OpenDocument][Billy Goat: Active worm detection and capture]]
:PROPERTIES:
:CV_ENV:   cvsubentry
:FROM: 2002
:TO: 2008
:END:

- An active worm-detection system, in wide deployment in the IBM worldwide internal network. Billy Goat listens for connections to unused IP address ranges and actively responds to those connections to accurately detect worm-infected machines, and in many cases capture the worms themselves. Billy Goat is engineered for distributed deployment, with each device containing standalone detection and reporting capabilities, together with data centralization features that allow network-wide data analysis and reporting.
- Publications: {{{cvcite(riordan06:_build_billy_goat:first2006\, riordan05:bg_techreport)}}}

*** [[http://www.usenix.org/event/sruti07/tech/full_papers/zamboni/zamboni.pdf][Router-based Billy Goat]]
:PROPERTIES:
:CV_ENV:   cvsubentry
:FROM: 2005
:TO: 2007
:END:

- An active worm-capture device deployed at the network boundary and coupled with the border router, that allows the Billy Goat to effectively and automatically spoof every unused IP address outside the local network. This makes it possible for the Router-based Billy Goat to accurately detect local infected machines and prevent them from establishing connections to the outside, limiting the propagation of the worms to the outside network.
- Publications: {{{cvcite(zamboni07:sruti07-rbg)}}}

*** SOC in a Box
:PROPERTIES:
:CV_ENV:   cvsubentry
:FROM: 2005
:TO: 2007
:END:

- Integrated device containing multiple security tools: intrusion detection, worm detection, vulnerability scanning and network discovery.

*** Exorcist
:PROPERTIES:
:CV_ENV:   cvsubentry
:FROM: 2001
:TO: 2002
:END:

- Host-based, behavior-based intrusion detection using sequences of system calls.

** Ph.D. Thesis Research
:PROPERTIES:
:CV_ENV:   cvemployer
:END:

*** [[https://zzamboni.org/cerias/zamboni/thesis/][Using internal sensors and embedded detectors for intrusion detection]]
:PROPERTIES:
:CV_ENV:   cvsubentry
:END:

- Study of data collection methods for intrusion detection systems.
- Implementation of novel methods for data collection in intrusion detection systems.
- Analysis of the properties, advantages and disadvantages of internal sensors and embedded detectors as data collection and analysis elements in intrusion detection systems.
- Publications: {{{cvcite(zamboni01:phd-thesis\, zamboni02:sensors_detectors\, kerschbaum00:network-embedded-sensors\, zamboni00:thesis-proposal\, zamboni:raid2000)}}}

** Additional research projects
:PROPERTIES:
:CV_ENV:   cvemployer
:END:

*** [[https://www.cerias.purdue.edu/site/about/history/coast/projects/aafid.php][Using autonomous agents for intrusion detection]]
:PROPERTIES:
:CV_ENV:   cvsubentry
:END:

- Design and documentation of an architecture (AAFID) to perform distributed monitoring and intrusion detection using autonomous agents.
- Implementation of a prototype according to the architecture. This prototype is [[http://freshmeat.net/projects/aafid2][published as open source]].
- Exploration of research issues in the distributed intrusion detection area.
- Publications: {{{cvcite(spafford00:intrus_detec_auton_agent\, zamboni:aafid-acsac98\, zamboni:aafid-architecture\, zamboni:raid98\, zamboni00:build_aafid_with_perl\, zamboni:raid99)}}}.

*** [[https://www.cerias.purdue.edu/site/about/history/coast/projects/coast-proj-synkill.php][Analysis of a denial-of-service attack on TCP/IP (Synkill)]]
:PROPERTIES:
:CV_ENV:   cvsubentry
:END:

- Collaborated in the analysis of the SYN-flooding denial-of-service attack against TCP and in the implementation of a defense tool.
- Publications: {{{cvcite(schuba97:synkill)}}}.

* System Development and Management
:PROPERTIES:
:CV_ENV:   cvskills
:END:

- Programming languages :: C, Perl, Java, AWK, Unix shells (Elvish shell, Bourne shell, C shell, Korn shell), Python, PHP, Ruby, Objective~C, Cocoa (MacOS X), Go, Clojure.
- Development environments :: Unix/Linux, OpenStack, Cloud Foundry, Amazon EC2, Mac OS X.
- Unix system administration :: Linux (experience with multiple distributions including RedHat, Ubuntu, Debian, Gentoo, and others), OpenBSD, FreeBSD, MacOS X, MacOS X Server, Solaris.
- Configuration management :: CFEngine 3, Puppet, Chef, Ansible.
- Virtualization, containers and cloud :: VMWare (ESX, vSphere), OpenStack, Amazon EC2, Docker, Cloud Foundry.
- Health Management and Monitoring :: VMware vRealize Operations Manager, vRealize Log Insight, Nagios, Icinga.
- Other :: REST APIs, Riemann (event stream processing), XML and related technologies, network programming, database programming (SQL), kernel programming (OpenBSD and Linux), HTML.

* Software Development Projects

** Publicly-available software projects: see [[https://github.com/zzamboni/][https://github.com/zzamboni/]]

** Other software projects (not publicly available)

*** Pilatus (IBM)
:PROPERTIES:
:CV_ENV:   cvsubentry
:FROM: 2005
:TO: 2007
:END:

A system installer that allows arbitrary system installation and configurations, allowing for both proprietary and open source components to be installed in an automated fashion. Open source components can be downloaded directly from their original source to avoid distributing them.

*** SOC in a Box (IBM)
:PROPERTIES:
:CV_ENV:   cvsubentry
:FROM: 2005
:TO: 2007
:END:

A specialized Linux distribution containing multiple security services for integrated security monitoring in small and medium networks. Implementation includes also backend infrastructure components for system installation, configuration and upgrade; and data centralization, analysis and reporting.

*** Billy Goat (IBM)
:PROPERTIES:
:CV_ENV:   cvsubentry
:FROM: 2002
:TO: 2007
:END:

A specialized Linux distribution containing multiple sensors for detection of large-scale automated attacks. Implementation includes also backend infrastructure components for system configuration and upgrade, data centralization, analysis and reporting.

*** Embedded Sensors Project (ESP)
:PROPERTIES:
:CV_ENV:   cvsubentry
:FROM: 1999
:TO: 2001
:END:

A system of sensors for intrusion detection developed in OpenBSD through code instrumentation. Developed as part of my Ph.D. thesis work. Programming done mostly in C.

* Honors & Awards
:PROPERTIES:
:CV_ENV:   cvhonors
:END:

