zamboni-vita.html

<div id="outline-container-orgad3b996" class="outline-4">
<h4 id="orgad3b996"><a href="http://domino.research.ibm.com/library/cyberdig.nsf/1e4115aea78b6e7c85256b360066f0d4/d7c39a9a2e73d870852570060051dfed?OpenDocument">Billy Goat: Active worm detection and capture</a></h4>
<div class="outline-text-4" id="text-orgad3b996">
<pre class="example">
FROM: 2002
TO: 2008
</pre>

<ul class="org-ul">
<li>An active worm-detection system, in wide deployment in the IBM worldwide internal network. Billy Goat listens for connections to unused IP address ranges and actively responds to those connections to accurately detect worm-infected machines, and in many cases capture the worms themselves. Billy Goat is engineered for distributed deployment, with each device containing standalone detection and reporting capabilities, together with data centralization features that allow network-wide data analysis and reporting.</li>
<li>Publications: \cite{riordan06:_build_billy_goat:first2006, riordan05:bg_techreport}</li>
</ul>
</div>
</div>

<div id="outline-container-orgbdeca95" class="outline-4">
<h4 id="orgbdeca95"><a href="http://www.usenix.org/event/sruti07/tech/full_papers/zamboni/zamboni.pdf">Router-based Billy Goat</a></h4>
<div class="outline-text-4" id="text-orgbdeca95">
<pre class="example">
FROM: 2005
TO: 2007
</pre>

<ul class="org-ul">
<li>An active worm-capture device deployed at the network boundary and coupled with the border router, that allows the Billy Goat to effectively and automatically spoof every unused IP address outside the local network. This makes it possible for the Router-based Billy Goat to accurately detect local infected machines and prevent them from establishing connections to the outside, limiting the propagation of the worms to the outside network.</li>
<li>Publications: \cite{zamboni07:sruti07-rbg}</li>
</ul>
</div>
</div>

<div id="outline-container-org618ff4f" class="outline-4">
<h4 id="org618ff4f">SOC in a Box</h4>
<div class="outline-text-4" id="text-org618ff4f">
<pre class="example">
FROM: 2005
TO: 2007
</pre>

<ul class="org-ul">
<li>Integrated device containing multiple security tools: intrusion detection, worm detection, vulnerability scanning and network discovery.</li>
</ul>
</div>
</div>

<div id="outline-container-orgfabc94a" class="outline-4">
<h4 id="orgfabc94a">Exorcist</h4>
<div class="outline-text-4" id="text-orgfabc94a">
<pre class="example">
FROM: 2001
TO: 2002
</pre>

<ul class="org-ul">
<li>Host-based, behavior-based intrusion detection using sequences of system calls.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org4ef61ff" class="outline-3">
<h3 id="org4ef61ff">Ph.D. Thesis Research</h3>
<div class="outline-text-3" id="text-org4ef61ff">
</div>

<div id="outline-container-orgb169268" class="outline-4">
<h4 id="orgb169268"><a href="https://zzamboni.org/cerias/zamboni/thesis/">Using internal sensors and embedded detectors for intrusion detection</a></h4>
<div class="outline-text-4" id="text-orgb169268">
<ul class="org-ul">
<li>Study of data collection methods for intrusion detection systems.</li>
<li>Implementation of novel methods for data collection in intrusion detection systems.</li>
<li>Analysis of the properties, advantages and disadvantages of internal sensors and embedded detectors as data collection and analysis elements in intrusion detection systems.</li>
<li>Publications: \cite{zamboni01:phd-thesis, zamboni02:sensors_detectors, kerschbaum00:network-embedded-sensors, zamboni00:thesis-proposal, zamboni:raid2000}</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org1ae525a" class="outline-3">
<h3 id="org1ae525a">Additional research projects</h3>
<div class="outline-text-3" id="text-org1ae525a">
</div>

<div id="outline-container-org040ee2e" class="outline-4">
<h4 id="org040ee2e"><a href="https://www.cerias.purdue.edu/site/about/history/coast/projects/aafid.php">Using autonomous agents for intrusion detection</a></h4>
<div class="outline-text-4" id="text-org040ee2e">
<ul class="org-ul">
<li>Design and documentation of an architecture (AAFID) to perform distributed monitoring and intrusion detection using autonomous agents.</li>
<li>Implementation of a prototype according to the architecture. This prototype is <a href="http://freshmeat.net/projects/aafid2">published as open source</a>.</li>
<li>Exploration of research issues in the distributed intrusion detection area.</li>
<li>Publications: \cite{spafford00:intrus_detec_auton_agent, zamboni:aafid-acsac98, zamboni:aafid-architecture, zamboni:raid98, zamboni00:build_aafid_with_perl, zamboni:raid99}.</li>
</ul>
</div>
</div>

<div id="outline-container-org020de4d" class="outline-4">
<h4 id="org020de4d"><a href="https://www.cerias.purdue.edu/site/about/history/coast/projects/coast-proj-synkill.php">Analysis of a denial-of-service attack on TCP/IP (Synkill)</a></h4>
<div class="outline-text-4" id="text-org020de4d">
<ul class="org-ul">
<li>Collaborated in the analysis of the SYN-flooding denial-of-service attack against TCP and in the implementation of a defense tool.</li>
<li>Publications: \cite{schuba97:synkill}.</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-org2a59caa" class="outline-2">
<h2 id="org2a59caa"><span class="section-number-2">7</span> System Development and Management</h2>
<div class="outline-text-2" id="text-7">
<dl class="org-dl">
<dt>Programming languages</dt><dd>C, Perl, Java, AWK, Unix shells (Elvish shell, Bourne shell, C shell, Korn shell), Python, PHP, Ruby, Objective~C, Cocoa (MacOS X), Go, Clojure.</dd>
<dt>Development environments</dt><dd>Unix/Linux, OpenStack, Cloud Foundry, Amazon EC2, Mac OS X.</dd>
<dt>Unix system administration</dt><dd>Linux (experience with multiple distributions including RedHat, Ubuntu, Debian, Gentoo, and others), OpenBSD, FreeBSD, MacOS X, MacOS X Server, Solaris.</dd>
<dt>Configuration management</dt><dd>CFEngine 3, Puppet, Chef, Ansible.</dd>
<dt>Virtualization, containers and cloud</dt><dd>VMWare (ESX, vSphere), OpenStack, Amazon EC2, Docker, Cloud Foundry.</dd>
<dt>Health Management and Monitoring</dt><dd>VMware vRealize Operations Manager, vRealize Log Insight, Nagios, Icinga.</dd>
<dt>Other</dt><dd>REST APIs, Riemann (event stream processing), XML and related technologies, network programming, database programming (SQL), kernel programming (OpenBSD and Linux), HTML.</dd>
</dl>
</div>
</div>

<div id="outline-container-org416ff64" class="outline-2">
<h2 id="org416ff64"><span class="section-number-2">8</span> Software Development Projects</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-orga46107a" class="outline-3">
<h3 id="orga46107a">Publicly-available software projects: see <a href="https://github.com/zzamboni/">https://github.com/zzamboni/</a></h3>
</div>

<div id="outline-container-orga7d5e98" class="outline-3">
<h3 id="orga7d5e98">Other software projects (not publicly available)</h3>
<div class="outline-text-3" id="text-orga7d5e98">
</div>
<div id="outline-container-org92d7af0" class="outline-4">
<h4 id="org92d7af0">Pilatus (IBM)</h4>
<div class="outline-text-4" id="text-org92d7af0">
<pre class="example">
FROM: 2005
TO: 2007
</pre>

<p>
A system installer that allows arbitrary system installation and configurations, allowing for both proprietary and open source components to be installed in an automated fashion. Open source components can be downloaded directly from their original source to avoid distributing them.
</p>
</div>
</div>

<div id="outline-container-org3c63193" class="outline-4">
<h4 id="org3c63193">SOC in a Box (IBM)</h4>
<div class="outline-text-4" id="text-org3c63193">
<pre class="example">
FROM: 2005
TO: 2007
</pre>

<p>
A specialized Linux distribution containing multiple security services for integrated security monitoring in small and medium networks. Implementation includes also backend infrastructure components for system installation, configuration and upgrade; and data centralization, analysis and reporting.
</p>
</div>
</div>

<div id="outline-container-orgedf7925" class="outline-4">
<h4 id="orgedf7925">Billy Goat (IBM)</h4>
<div class="outline-text-4" id="text-orgedf7925">
<pre class="example">
FROM: 2002
TO: 2007
</pre>

<p>
A specialized Linux distribution containing multiple sensors for detection of large-scale automated attacks. Implementation includes also backend infrastructure components for system configuration and upgrade, data centralization, analysis and reporting.
</p>
</div>
</div>

<div id="outline-container-orgbe88db9" class="outline-4">
<h4 id="orgbe88db9">Embedded Sensors Project (ESP)</h4>
<div class="outline-text-4" id="text-orgbe88db9">
<pre class="example">
FROM: 1999
TO: 2001
</pre>

<p>
A system of sensors for intrusion detection developed in OpenBSD through code instrumentation. Developed as part of my Ph.D. thesis work. Programming done mostly in C.
</p>
</div>
</div>
</div>
</div>
