zamboni-vita.org
** [[https://cfengine.com/engage/cfengine-champions/][CFEngine Champion]]
:PROPERTIES:
:CV_ENV:   cvhonor
:DATE: 2010
:ORGANIZATION: CFEngine AS
:LOCATION: Norway
:END:

** Josef Raviv Memorial Postdoctoral Fellowship
:PROPERTIES:
:CV_ENV:   cvhonor
:DATE: <2001-07-01>
:ORGANIZATION: IBM
:LOCATION: U.S.A.
:END:

** Member of [[http://www.phibetadelta.org][Phi Beta Delta]]
:PROPERTIES:
:CV_ENV:   cvhonor
:DATE: <2001-04-01>
:ORGANIZATION: honor society recognizing scholarly achievement
:LOCATION: U.S.A.
:END:

** UPE Microsoft Scholarship Award
:PROPERTIES:
:CV_ENV:   cvhonor
:DATE: <2000-09-01>
:ORGANIZATION: honor society recognizing scholarly achievement
:LOCATION: U.S.A.
:END:

** Member of [[http://upe.acm.org/][Upsilon Pi Epsilon]]
:PROPERTIES:
:CV_ENV:   cvhonor
:DATE: <1998-04-01>
:ORGANIZATION: the ACM Computer Sciences honor society
:LOCATION: U.S.A.
:END:

** Fulbright Scholarship
:PROPERTIES:
:CV_ENV:   cvhonor
:DATE: <1996-05-01>
:ORGANIZATION: for pursuing Ph.D. studies at Purdue University
:LOCATION: Mexico
:END:

* Other Professional Activities
:PROPERTIES:
:CV_ENV:   cvhonors
:END:

** [[http://www.acm.org/][The Association for Computing Machinery (ACM)]]
:PROPERTIES:
:CV_ENV:   cvhonor
:POSITION: Member
:FROM: 1998
:TO:
:END:

** [[http://purdue.pm.org/][Purdue.pm]], the Purdue Perl Users Group
:PROPERTIES:
:CV_ENV:   cvhonor
:POSITION: Founder
:DATE: 2000
:LOCATION: U.S.A.
:END:

** [[https://www.cs.purdue.edu/future-students/organizations.html][Purdue University Chapter of Upsilon Pi Epsilon]]
:PROPERTIES:
:CV_ENV:   cvhonor
:POSITION: President
:DATE: 1999
:LOCATION: U.S.A.
:END:

** [[https://www.cs.purdue.edu/future-students/organizations.html][Purdue University Chapter of Upsilon Pi Epsilon]]
:PROPERTIES:
:CV_ENV:   cvhonor
:POSITION: Secretary
:DATE: 1998
:LOCATION: U.S.A.
:END:

* Program Committees and Boards
:PROPERTIES:
:CV_ENV:   cvhonors
:END:

** [[http://www.elsevier.com/wps/find/journaldescription.cws_home/405877/description][Editorial Board Member]]
:PROPERTIES:
:CV_ENV:   cvhonor
:ORGANIZATION: Computers \& Security Journal
:DATE: 2011--2013
:END:

** [[http://www.raid-symposium.org/][Steering Committee Member]]
:PROPERTIES:
:CV_ENV:   cvhonor
:ORGANIZATION: Intl. Symposium on Recent Advances in Intrusion Detection
:DATE: 2007--2012
:END:

** [[http://www.raid-symposium.org/raid2006/][Program chair]]
:PROPERTIES:
:CV_ENV:   cvhonor
:ORGANIZATION: 9th Intl. Symposium on Recent Advances in Intrusion Detection (RAID)
:DATE: 2006
:LOCATION: Germany
:END:

** [[http://www.raid-symposium.org/][Program Committee Member]]
:PROPERTIES:
:CV_ENV:   cvhonor
:ORGANIZATION: Intl. Symposium on Recent Advances in Intrusion Detection
:DATE: 2006
:END:

** Program co-chair
:PROPERTIES:
:CV_ENV:   cvhonor
:ORGANIZATION: IBM Academy of Technology Security and Privacy Symposium
:DATE: 2009
:END:

** [[https://www.video.ethz.ch/conferences/2009/zisc.html][Program chair]]
:PROPERTIES:
:CV_ENV:   cvhonor
:ORGANIZATION: ZISC Workshop on Security in Virtualized Environments and Cloud Computing
:DATE: 2009
:LOCATION: Switzerland
:END:

** [[https://www.dimva.org/dimva2008/][Program chair]]
:PROPERTIES:
:CV_ENV:   cvhonor
:ORGANIZATION: Detection of Intrusions and Malware \& Vulnerability Assessment (DIMVA)
:DATE: 2008
:LOCATION: France
:END:

** [[http://www.ieee-security.org/TC/SP-Index.html][Program Committee Member]]
:PROPERTIES:
:CV_ENV:   cvhonor
:ORGANIZATION: IEEE Security and Privacy Symposium
:DATE: 2007
:LOCATION: U.S.A.
:END:

** [[http://www.acsac.org/][Program Committee Member]]
:PROPERTIES:
:CV_ENV:   cvhonor
:ORGANIZATION: Annual Computer Security Applications Conference (ACSAC)
:DATE: 2003--2007
:END:

** Program Committee Member
:PROPERTIES:
:CV_ENV:   cvhonor
:ORGANIZATION: International Computer Security Day Conference
:DATE: 1994--2000
:LOCATION: Mexico
:END:

** Organizer
:PROPERTIES:
:CV_ENV:   cvhonor
:ORGANIZATION: International Computer Security Day Conference
:DATE: 1994--1995
:LOCATION: Mexico
:END:
* Teaching and Advising

** Students

*** Daniele Sgandurra, University of Pisa, Italy
:PROPERTIES:
:CV_ENV:   cvsubentry
:LABEL: Internship advisor
:FROM: 2009
:TO: 2009
:END:

- Project: Design and implementation of process injection using virtual machine introspection.

*** Martin Carbone, Georgia Institute of Technology, U.S.A.
:PROPERTIES:
:CV_ENV:   cvsubentry
:LABEL: Internship advisor
:FROM: 2007
:TO: 2007
:END:

Project: Implementation of a proof of concept Hyperjacking attack on Intel platform.

*** Urko Zurutuza Ortega, Mondragon University, Spain
:PROPERTIES:
:CV_ENV:   cvsubentry
:LABEL: Ph.D. co-advisor
:FROM: 2005
:TO: 2008
:END:

- Thesis: [[https://dialnet.unirioja.es/servlet/tesis?codigo=20012][Data Mining Approaches for Analysis of Worm Activity Towards Automatic Signature Generation]]

*** Milton Yates, ENST Bretagne, France
:PROPERTIES:
:CV_ENV:   cvsubentry
:LABEL: External Diploma Thesis advisor
:FROM: 2005
:TO: 2005
:END:

- Thesis: [[https://www.usenix.org/conference/sruti-07/boundary-detection-and-containment-local-worm-infections][The Router-based Billy Goat Project]]

*** Candid Wüest, ETH Zurich, Switzerland
:PROPERTIES:
:CV_ENV:   cvsubentry
:LABEL: Diploma Thesis tutor
:FROM: 2002
:TO: 2003
:END:

- Thesis: [[https://pub.tik.ee.ethz.ch/students/2002-2003-Wi/DA-2003-22.pdf][Desktop Firewalls and Intrusion Detection]]

** Teaching

*** CFEngine one-day training class (8 hour class)
:PROPERTIES:
:CV_ENV:   cvsubentry
:LABEL: Multiple venues
:FROM: 2011
:TO: 2013
:END:

*** "Virtualization" lecture (2 hours), Systems Security class, Computer Science Dept.
:PROPERTIES:
:CV_ENV:   cvsubentry
:LABEL: Multiple venues
:FROM: 2011
:TO: 2013
:END:

