zamboni-vita.html

<div id="outline-container-orgdaa5668" class="outline-2">
<h2 id="orgdaa5668"><span class="section-number-2">9</span> Honors &amp; Awards</h2>
<div class="outline-text-2" id="text-9">
</div>

<div id="outline-container-orgd49648b" class="outline-3">
<h3 id="orgd49648b"><a href="https://cfengine.com/engage/cfengine-champions/">CFEngine Champion</a></h3>
<div class="outline-text-3" id="text-orgd49648b">
<pre class="example">
DATE: 2010
ORGANIZATION: CFEngine AS
LOCATION: Norway
</pre>
</div>
</div>

<div id="outline-container-orgfe89908" class="outline-3">
<h3 id="orgfe89908">Josef Raviv Memorial Postdoctoral Fellowship</h3>
<div class="outline-text-3" id="text-orgfe89908">
<pre class="example">
DATE: <2001-07-01>
ORGANIZATION: IBM
LOCATION: U.S.A.
</pre>
</div>
</div>

<div id="outline-container-org7403b64" class="outline-3">
<h3 id="org7403b64">Member of <a href="http://www.phibetadelta.org">Phi Beta Delta</a></h3>
<div class="outline-text-3" id="text-org7403b64">
<pre class="example">
DATE: <2001-04-01>
ORGANIZATION: honor society recognizing scholarly achievement
LOCATION: U.S.A.
</pre>
</div>
</div>

<div id="outline-container-orgf2113a0" class="outline-3">
<h3 id="orgf2113a0">UPE Microsoft Scholarship Award</h3>
<div class="outline-text-3" id="text-orgf2113a0">
<pre class="example">
DATE: <2000-09-01>
ORGANIZATION: honor society recognizing scholarly achievement
LOCATION: U.S.A.
</pre>
</div>
</div>

<div id="outline-container-org3eb656e" class="outline-3">
<h3 id="org3eb656e">Member of <a href="http://upe.acm.org/">Upsilon Pi Epsilon</a></h3>
<div class="outline-text-3" id="text-org3eb656e">
<pre class="example">
DATE: <1998-04-01>
ORGANIZATION: the ACM Computer Sciences honor society
LOCATION: U.S.A.
</pre>
</div>
</div>

<div id="outline-container-orga947b83" class="outline-3">
<h3 id="orga947b83">Fulbright Scholarship</h3>
<div class="outline-text-3" id="text-orga947b83">
<pre class="example">
DATE: <1996-05-01>
ORGANIZATION: for pursuing Ph.D. studies at Purdue University
LOCATION: Mexico
</pre>
</div>
</div>
</div>

<div id="outline-container-org1f9501b" class="outline-2">
<h2 id="org1f9501b"><span class="section-number-2">10</span> Other Professional Activities</h2>
<div class="outline-text-2" id="text-10">
</div>

<div id="outline-container-orgc8c9117" class="outline-3">
<h3 id="orgc8c9117"><a href="http://www.acm.org/">The Association for Computing Machinery (ACM)</a></h3>
<div class="outline-text-3" id="text-orgc8c9117">
<pre class="example">
POSITION: Member
FROM: 1998
TO:
</pre>
</div>
</div>

<div id="outline-container-orgf3901a1" class="outline-3">
<h3 id="orgf3901a1"><a href="http://purdue.pm.org/">Purdue.pm</a>, the Purdue Perl Users Group</h3>
<div class="outline-text-3" id="text-orgf3901a1">
<pre class="example">
POSITION: Founder
DATE: 2000
LOCATION: U.S.A.
</pre>
</div>
</div>

<div id="outline-container-org638df76" class="outline-3">
<h3 id="org638df76"><a href="https://www.cs.purdue.edu/future-students/organizations.html">Purdue University Chapter of Upsilon Pi Epsilon</a></h3>
<div class="outline-text-3" id="text-org638df76">
<pre class="example">
POSITION: President
DATE: 1999
LOCATION: U.S.A.
</pre>
</div>
</div>

<div id="outline-container-orgdf80884" class="outline-3">
<h3 id="orgdf80884"><a href="https://www.cs.purdue.edu/future-students/organizations.html">Purdue University Chapter of Upsilon Pi Epsilon</a></h3>
<div class="outline-text-3" id="text-orgdf80884">
<pre class="example">
POSITION: Secretary
DATE: 1998
LOCATION: U.S.A.
</pre>
</div>
</div>
</div>

<div id="outline-container-org25375f7" class="outline-2">
<h2 id="org25375f7"><span class="section-number-2">11</span> Program Committees and Boards</h2>
<div class="outline-text-2" id="text-11">
</div>

<div id="outline-container-org61df797" class="outline-3">
<h3 id="org61df797"><a href="http://www.elsevier.com/wps/find/journaldescription.cws_home/405877/description">Editorial Board Member</a></h3>
<div class="outline-text-3" id="text-org61df797">
<pre class="example">
ORGANIZATION: Computers \& Security Journal
DATE: 2011--2013
</pre>
</div>
</div>

<div id="outline-container-org862837f" class="outline-3">
<h3 id="org862837f"><a href="http://www.raid-symposium.org/">Steering Committee Member</a></h3>
<div class="outline-text-3" id="text-org862837f">
<pre class="example">
ORGANIZATION: Intl. Symposium on Recent Advances in Intrusion Detection
DATE: 2007--2012
</pre>
</div>
</div>

<div id="outline-container-org50c01fd" class="outline-3">
<h3 id="org50c01fd"><a href="http://www.raid-symposium.org/raid2006/">Program chair</a></h3>
<div class="outline-text-3" id="text-org50c01fd">
<pre class="example">
ORGANIZATION: 9th Intl. Symposium on Recent Advances in Intrusion Detection (RAID)
DATE: 2006
LOCATION: Germany
</pre>
</div>
</div>

<div id="outline-container-org18c45b8" class="outline-3">
<h3 id="org18c45b8"><a href="http://www.raid-symposium.org/">Program Committee Member</a></h3>
<div class="outline-text-3" id="text-org18c45b8">
<pre class="example">
ORGANIZATION: Intl. Symposium on Recent Advances in Intrusion Detection
DATE: 2006
</pre>
</div>
</div>

<div id="outline-container-orgfe334f3" class="outline-3">
<h3 id="orgfe334f3">Program co-chair</h3>
<div class="outline-text-3" id="text-orgfe334f3">
<pre class="example">
ORGANIZATION: IBM Academy of Technology Security and Privacy Symposium
DATE: 2009
</pre>
</div>
</div>

<div id="outline-container-org3dae8eb" class="outline-3">
<h3 id="org3dae8eb"><a href="https://www.video.ethz.ch/conferences/2009/zisc.html">Program chair</a></h3>
<div class="outline-text-3" id="text-org3dae8eb">
<pre class="example">
ORGANIZATION: ZISC Workshop on Security in Virtualized Environments and Cloud Computing
DATE: 2009
LOCATION: Switzerland
</pre>
</div>
</div>

<div id="outline-container-org346a530" class="outline-3">
<h3 id="org346a530"><a href="https://www.dimva.org/dimva2008/">Program chair</a></h3>
<div class="outline-text-3" id="text-org346a530">
<pre class="example">
ORGANIZATION: Detection of Intrusions and Malware \& Vulnerability Assessment (DIMVA)
DATE: 2008
LOCATION: France
</pre>
</div>
</div>

<div id="outline-container-org03f93d1" class="outline-3">
<h3 id="org03f93d1"><a href="http://www.ieee-security.org/TC/SP-Index.html">Program Committee Member</a></h3>
<div class="outline-text-3" id="text-org03f93d1">
<pre class="example">
ORGANIZATION: IEEE Security and Privacy Symposium
DATE: 2007
LOCATION: U.S.A.
</pre>
</div>
</div>

<div id="outline-container-org64d9b49" class="outline-3">
<h3 id="org64d9b49"><a href="http://www.acsac.org/">Program Committee Member</a></h3>
<div class="outline-text-3" id="text-org64d9b49">
<pre class="example">
ORGANIZATION: Annual Computer Security Applications Conference (ACSAC)
DATE: 2003--2007
</pre>
</div>
</div>

<div id="outline-container-org398b1da" class="outline-3">
<h3 id="org398b1da">Program Committee Member</h3>
<div class="outline-text-3" id="text-org398b1da">
<pre class="example">
ORGANIZATION: International Computer Security Day Conference
DATE: 1994--2000
LOCATION: Mexico
</pre>
</div>
</div>

<div id="outline-container-org9f3eb79" class="outline-3">
<h3 id="org9f3eb79">Organizer</h3>
<div class="outline-text-3" id="text-org9f3eb79">
<pre class="example">
ORGANIZATION: International Computer Security Day Conference
DATE: 1994--1995
LOCATION: Mexico
</pre>
</div>
</div>
</div>
<div id="outline-container-org4344268" class="outline-2">
<h2 id="org4344268"><span class="section-number-2">12</span> Teaching and Advising</h2>
<div class="outline-text-2" id="text-12">
</div>
<div id="outline-container-org1c4c4cc" class="outline-3">
<h3 id="org1c4c4cc">Students</h3>
<div class="outline-text-3" id="text-org1c4c4cc">
</div>
<div id="outline-container-org5c6c2b7" class="outline-4">
<h4 id="org5c6c2b7">Daniele Sgandurra, University of Pisa, Italy</h4>
<div class="outline-text-4" id="text-org5c6c2b7">
<pre class="example">
LABEL: Internship advisor
FROM: 2009
TO: 2009
</pre>

<ul class="org-ul">
<li>Project: Design and implementation of process injection using virtual machine introspection.</li>
</ul>
</div>
</div>

<div id="outline-container-org404b18a" class="outline-4">
<h4 id="org404b18a">Martin Carbone, Georgia Institute of Technology, U.S.A.</h4>
<div class="outline-text-4" id="text-org404b18a">
<pre class="example">
LABEL: Internship advisor
FROM: 2007
TO: 2007
</pre>

<p>
Project: Implementation of a proof of concept Hyperjacking attack on Intel platform.
</p>
</div>
</div>

<div id="outline-container-org4abe496" class="outline-4">
<h4 id="org4abe496">Urko Zurutuza Ortega, Mondragon University, Spain</h4>
<div class="outline-text-4" id="text-org4abe496">
<pre class="example">
LABEL: Ph.D. co-advisor
FROM: 2005
TO: 2008
</pre>

<ul class="org-ul">
<li>Thesis: <a href="https://dialnet.unirioja.es/servlet/tesis?codigo=20012">Data Mining Approaches for Analysis of Worm Activity Towards Automatic Signature Generation</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgea8484b" class="outline-4">
<h4 id="orgea8484b">Milton Yates, ENST Bretagne, France</h4>
<div class="outline-text-4" id="text-orgea8484b">
<pre class="example">
LABEL: External Diploma Thesis advisor
FROM: 2005
TO: 2005
</pre>

<ul class="org-ul">
<li>Thesis: <a href="https://www.usenix.org/conference/sruti-07/boundary-detection-and-containment-local-worm-infections">The Router-based Billy Goat Project</a></li>
</ul>
</div>
</div>

<div id="outline-container-org6be6c32" class="outline-4">
<h4 id="org6be6c32">Candid Wüest, ETH Zurich, Switzerland</h4>
<div class="outline-text-4" id="text-org6be6c32">
<pre class="example">
LABEL: Diploma Thesis tutor
FROM: 2002
TO: 2003
</pre>

<ul class="org-ul">
<li>Thesis: <a href="https://pub.tik.ee.ethz.ch/students/2002-2003-Wi/DA-2003-22.pdf">Desktop Firewalls and Intrusion Detection</a></li>
</ul>
</div>
</div>
</div>
